{"keras_version": "2.0.4", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "dtype": "float32", "batch_input_shape": [null, 30, 76], "name": "input_1"}}, {"class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"units": 64, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "trainable": true, "stateful": false, "name": "lstm_1", "go_backwards": false, "bias_constraint": null, "implementation": 0, "dropout": 0.0, "bias_regularizer": null, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"units": 64, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "trainable": true, "stateful": false, "name": "lstm_2", "go_backwards": false, "bias_constraint": null, "implementation": 0, "dropout": 0.0, "bias_regularizer": null, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_constraint": null}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"rate": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 76, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "activation": "softmax", "name": "activation_1"}}]}}